# Pandas는 무엇인가요?
데이터 분석 및 가공에 사용되는 파이썬 라이브러리입니다

In [2]:
import pandas as pd
# !pip install OrderedDict

# 데이터프레임은 무엇인가요?
가로축과 세로축이 있는 엑셀과 유사한 데이터구조입니다. 가로축은 로우(행), 세로축은 컬럼(열)이라고 합니다.

In [508]:
# 데이터프레임이 가지고 있는 함수의 예제입니다.

# 시리즈는 무엇인가요?
데이터프레임의 컬럼(행)은 모두 시리즈입니다. 위의 예제는 3개의 시리즈로 구성된 데이터프레임입니다.

In [509]:
# 시리즈의 함수 예제입니다.

시리즈는 단순히 파이썬 리스트를 간직한 오브젝트입니다.  
리스트를 파라미터로 주면 바로 시리즈가 생성됩니다.  
시리즈는 데이터 가공 및 분석이 파이썬 리스트보다 훨씬 쉽습니다.

# 파일을 데이터프레임으로 불러오기
데이터프레임 (dataframe)은 2차원 자료구조입니다. 로우와 컬럼으로 엑셀 형식과 유사합니다.  
기본적으로 csv 포맷을 지원하지만, 구분자로 컬럼이 구분되어 있는 데이터는 모두 지원합니다.  
read_csv 함수로 파일을 데이터프레임으로 호출할 수 있습니다.

아래는 csv 파일이 아닌 파일을 호출하는 예제입니다.  
파일명은 txt이지만, 쉼표로 컬럼이 구분되어 있는 파일입니다.

만약 파일의 컬럼들이 쉼표로 구분되어 있지 않을 경우라도, delimiter 파라미터에 구분자를 지정해줘서  
컬럼을 제대로 나줘줄 수 있습니다. 아래는 탭으로 컬럼이 구분된 경우의 예제입니다.

만약 파일에 데이터 헤더가 없을 경우, header = None으로 지정해줘서,  
첫번째 데이터가 데이터 헤더로 들어가는 것을 방지해줘야합니다.

헤더가 없는 데이터를 데이터프레임으로 호출했을 경우,  
아래와 같이 데이터프레임 생성 후에, 컬럼 헤더를 지정해주실 수 있습니다.

또한, 파일을 데이터프레임으로 호출하는 동시에, 헤더를 아래와 같이 지정해주실 수도 있습니다.

# 데이터프레임을 파이썬 코드로 생성하기

## 딕셔너리로 데이터프레임 생성하기
파이썬의 기본 자료구조로 데이터프레임 생성이 가능합니다.  
아래의 예제는 딕셔너리로 데이터프레임을 생성하는 예제입니다.

In [5]:
import pandas as pd
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [7]:
s = {1,2,'가',4.5}
s

{1, 2, 4.5, '가'}

데이터프레임 생성 시, 컬럼의 순서가 뒤바뀔 수 있습니다.  
아래와 같이 컬럼을 원하시는 순서로 지정하실 수 있습니다.

In [9]:
df = df[['name','age','job']]
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## OrderedDict로 데이터프레임 생성하기
OrderedDict 자료구조로 데이터프레임을 생성하면, 컬럼의 순서가 뒤바뀌지 않습니다.

In [1]:
from collections import OrderedDict

In [10]:
import pandas as pd
friend_ordered_dict = OrderedDict([('name',['Jhon','Jenny', 'Nate']),('age',[20,30,30]),
                                 ('job',['student','developer', 'teacher'])])
df = pd.DataFrame.from_dict(friend_ordered_dict)
df

    name  age        job
0   Jhon   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## list로 데이터프레임 생성하기
리스트로 데이터프레임을 생성하는 예제입니다.

In [29]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
column_name = ['name', 'age', 'job']
# df = pd.DataFrame.from_records(friend_list)
df = pd.DataFrame(friend_list, columns = column_name)
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# 파일로 데이터프레임을 저장하기

아래는 데이터프레임을 헤더와 함께 저장하는 예제입니다.

to_csv 함수를 사용하여 파일로 저장하실 수 있습니다.

In [21]:
df.to_csv('friend_list_ordered_dict.csv')

아래는 헤더가 없는 데이터프레임의 예제입니다.

to_csv 함수로 파일로 저장하실 수 있습니다.

In [19]:
df.to_csv('friend_list_from_df.csv')

사실 파일의 확장자명은 원하시는대로 주셔도 무방합니다.

In [20]:
df.to_csv('friend_list_from_df.txt')

기본적으로, 헤더와 인덱스값은 주시지 않아도, 기본적으로 True로 설정되어 있습니다.

In [30]:
df.to_csv('friend_list_from_df.csv', header = False, index = False)

**header = False** 는 컬럼 이름을 파일에 저장하지 않겠다라는 의미입니다. 예제에서 0,1,2가 헤더에 저장되지 않습니다.   
**index = False** 는 로우 인덱스를 파일에 저장하지 않겠다라는 의미입니다.  예제에서 0,1,2가 로우 인덱스에 저장되지 않습니다.

In [31]:
df.to_csv('friend_list_from_df.csv', header = ['name', 'age', 'job'])

헤더 정보를 원하실 경우, header 키워드로 컬럼 이름을 파일에 저장하실 수 있습니다.

In [61]:
friend_data = {
    'name': ['John', None, 'nate', '은아'],
    'age': [20, None, 30, 38],
    'job': ['student', 'developer', 'teacher', '백조']
}
df = pd.DataFrame(friend_data)
df

   name   age        job
0  John  20.0    student
1  None   NaN  developer
2  nate  30.0    teacher
3    은아  38.0         백조

In [33]:
df.head()

   name   age        job
0  John  20.0    student
1  None   NaN  developer
2  nate  30.0    teacher

아래는 **None** 값이 있는 데이터프레임의 예제입니다.

In [34]:
df.to_csv('friend_data_from_df.csv')

In [35]:
print(df)

   name   age        job
0  John  20.0    student
1  None   NaN  developer
2  nate  30.0    teacher

In [43]:
df.to_csv('friend_data_from_df2.csv', na_rep = '누락', encoding = 'cp949')

In [56]:
df = pd.read_csv('friend_data_from_df2.csv', encoding = 'cp949', index_col = 0)
df.drop('Unnamed: 0', axis = 1, inplace = True)
df

   name   age        job
0  John  20.0    student
1    누락    누락  developer
2  nate  30.0    teacher

# 로우 선택하기

## 인덱스로 로우 선택하기

아래는 로우 인덱스를 사용하여 로우1부터 3까지 순차적으로 선택하는 예제입니다.

In [62]:
df.loc[1:3]

   name   age        job
1  None   NaN  developer
2  nate  30.0    teacher
3    은아  38.0         백조

아래는 순차적이지 않은 로우를 선택하는 예제입니다.

In [57]:
df.loc[[0,2]]

   name   age      job
0  John  20.0  student
2  nate  30.0  teacher

In [64]:
df[['name','job']]

   name        job
0  John    student
1  None  developer
2  nate    teacher
3    은아         백조

## 컬럼값에 따른 로우 선택하기
마치 데이터베이스에 쿼리를 전달하듯, 특정한 컬럼값을 충족하는 로우만 선택하실 수 있습니다.

In [73]:
df.age>=25
df['age']>=25
#  같은 결과값

0    False
1    False
2     True
3     True
Name: age, dtype: bool

In [72]:
df_filtered = df[df['age'] >= 25]
df_filtered

   name   age      job
2  nate  30.0  teacher
3    은아  38.0       백조

In [74]:
df.query('age>25')

   name   age      job
2  nate  30.0  teacher
3    은아  38.0       백조

In [81]:
df.name == 'nate'  #bool형태
df[df.name == 'nate'] #결과값

   name   age      job
2  nate  30.0  teacher

In [90]:
df[(df.age >= 25) & (df.name == 'nate')]
df[(df['age'] >= 25) & (df['name'] == 'nate')]


df_filtered = df[(df['age'] >= 25) & (df['name'] == 'nate')]
df_filtered

   name   age      job
2  nate  30.0  teacher

# 컬럼 필터하기

## 인덱스로 필터하기

In [91]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
column_name = ['name', 'age', 'job']
df = pd.DataFrame.from_records(friend_list, columns=column_name)

모든 로우를 보여주되, 컬럼은 0부터 1까지만 출력하는 예제입니다.

In [110]:
df[['name','age']]
df.iloc[:,:2]

    name  age
0   John   20
1  Jenny   30
2   Nate   30

모든 로우를 보여주되, 컬럼 0와 2만 출력하는 예제입니다.

In [113]:
df.iloc[:,:2]
# df.iloc[:,[0,2]]

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

## 컬럼 이름으로 필터하기

In [128]:
# you can create column header for no header data at once
df = pd.read_csv('friend_list_no_head.csv', header = None, names = ['name','age','job'])

df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [122]:
df.columns = ['이름','나이','직업']

In [123]:
df

      이름  나이         직업
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [125]:
df_filtered = df[['이름','나이']]
df_filtered

      이름  나이
0   John  20
1  Jenny  30
2   Nate  30
3  Julia  40
4  Brian  45
5  Chris  25

## filter 함수

In [126]:
df.filter(items = ['나이','직업'])

   나이         직업
0  20    student
1  30  developer
2  30    teacher
3  40    dentist
4  45    manager
5  25     intern

원하는 글자를 가진 로우를 보여줍니다.

In [134]:
# select columns containing 'a'
print(df.filter(like = 'a', axis=1),'\n')


# select columns containing 'b'
df.filter(like = 'b', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

정규식으로 필터도 가능합니다.

In [133]:
# select columns using regex
df.filter(regex = '.*b', axis=1)

# ^a :a로 시작 / b$ :b로 끝나는

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

# 로우 드롭하기

로우 인덱스로 로우를 드롭할 수 있습니다.

In [208]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [136]:
df.head()

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

드롭된 결과는 데이터프레임에 저장되지 않습니다. 저장하고 싶으실 경우, 결과를 데이터프레임에 따로 저장하셔야 합니다.

In [139]:
df.drop(['John','Nate'])

       age        job
Jenny   30  developer

In [140]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

드롭된 결과를 데이터프레임에 저장하는 예제입니다.

In [145]:
df = df.drop(['John','Nate'])
df

       age        job
Jenny   30  developer

In [146]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [147]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [154]:
df.drop(df.index[[0,2]])

       age        job
Jenny   30  developer

### 드롭된 결과를 바로 데이터프레임에 저장하는 방법
inplace 키워드를 사용하시면, 따로 저장할 필요없이, 드롭된 결과가 데이터프레임에 반영됩니다.

In [211]:
df.drop(['John','Nate'], inplace=True)
df

KeyError: "['John', 'Nate'] not found in axis"

## 로우 인덱스로 드롭하기

로우 인덱스로 드롭하는 예제입니다.

## 컬럼값으로 로우 드롭하기

In [155]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [167]:
# df = df.drop('age', axis = 1)
# df

# 컬럼 드롭하기

In [ ]:
# 컬럼 추가 또는 변경하기

In [181]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

아래와 같은 방법으로 새로운 컬럼을 기본값과 함께 추가하실 수 있습니다.

In [182]:
df['salary'] = 0

In [183]:
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

기존 컬럼값을 가지고 새로운 컬럼을 생성하는 예제입니다.

In [550]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])

넘파이를 사용하셔서, 한줄에 새로운 컬럼값을 생성하실 수도 있습니다.

In [185]:
import numpy as np

In [190]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [193]:
df['adult'] = np.where(df['age'] < 21, 'teen', 'adult')
df

    name  age        job salary  adult
0   Jone   15    student     no   teen
1  Jenny   30  developer    yes  adult
2   Nate   30    teacher    yes  adult

In [219]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

아래는 기존에 있는 두 컬럼값을 더해서 새로운 컬럼을 만드는 예제입니다.

In [220]:
df['total'] = df['midterm'] + df['final']
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [221]:
df['sum'] = df[['midterm','final']].sum(axis=1)
df

    name  midterm  final  total  sum
0   John       95     85    180  180
1  Jenny       85     80    165  165
2   Nate       10     30     40   40

기존의 컬럼을 사용하여 새로운 컬럼을 만드는 예제입니다.

In [222]:
df = df.drop('sum', axis=1)
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [230]:
df['average'] = df['total']/2
df

    name  midterm  final  total  average    평균
0   John       95     85    180     90.0  90.0
1  Jenny       85     80    165     82.5  82.5
2   Nate       10     30     40     20.0  20.0

아래와 같이, 리스트에 조건별 값을 담아서, 새로운 컬럼으로 추가시킬 수 있습니다.

In [224]:
df['평균'] = df[['midterm','final']].mean(axis=1)
df

    name  midterm  final  total  average    평균
0   John       95     85    180     90.0  90.0
1  Jenny       85     80    165     82.5  82.5
2   Nate       10     30     40     20.0  20.0

In [232]:
grades = []

for i in df['average']:
    if i >= 90:
        grades.append('A')
    elif i >= 80:
        grades.append('B')
    elif i >= 70:
        grades.append('C')
    elif i >= 60:
        grades.append('D')
    else:
        grades.append('F')

In [241]:
df['grades'] = grades
df

    name  midterm  final  total  average    평균 grades
0   John       95     85    180     90.0  90.0      A
1  Jenny       85     80    165     82.5  82.5      B
2   Nate       10     30     40     20.0  20.0      F

In [246]:
df['plus_one'] =  df.total.apply(lambda x : x+1)
df

    name  midterm  final  total  average    평균 grades    평점  plus_one
0   John       95     85    180     90.0  90.0      A  PASS       181
1  Jenny       85     80    165     82.5  82.5      B  PASS       166
2   Nate       10     30     40     20.0  20.0      F  FAIL        41

apply 함수 사용 예제입니다.  
apply를 사용하시면, 깔끔하게 컬럼의 값을 변경하는 코드를 구현하실 수 있습니다.

In [242]:
def pass_or_fail(i):
    print(i)
    if i != 'F':
        return 'PASS'
    else:
        return 'FAIL'

In [256]:
# df['평점'] = df.grades.apply(pass_or_fail)
df['평점2'] = df.grades.apply(lambda x: 'pass' if x != 'F'else 'fail')
df

    name  midterm  final  total  average    평균 grades    평점  plus_one   평점2
0   John       95     85    180     90.0  90.0      A  PASS       181  pass
1  Jenny       85     80    165     82.5  82.5      B  PASS       166  pass
2   Nate       10     30     40     20.0  20.0      F  FAIL        41  fail

In [255]:
lst = [1,2,'3','4',5]
list(map(int,lst))

[1, 2, '3', '4', 5]

apply를 사용해서 연월일의 정보에서 연도만 빼보는 예제입니다.

In [258]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [260]:
df['yyyy-mm-dd'][0].split('-')

['2000', '06', '27']

In [264]:
def extract_tear(i):
    return int(i.split('-')[0])

In [266]:
df['year'] = df['yyyy-mm-dd'].apply(extract_tear)
print(df.info())
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   yyyy-mm-dd  3 non-null      object
 1   year        3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes
None

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [267]:
df.apply(lambda x: int(x.split('-')))

AttributeError: 'Series' object has no attribute 'split'

### apply 함수에 파라미터 전달하기
키워드 파라미터를 사용하시면, apply가 적용된 함수에 파라미터를 전달하실 수 있습니다.

In [268]:
def extract_year(year, current_year):
    return current_year - int(year)

In [270]:
df['age']= df['year'].apply(extract_year, current_year = 2023)

In [271]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   23
1  2002-09-24  2002   21
2  2005-12-20  2005   18

### apply 함수에 한 개 이상의 파라미터 전달하기
키워드 파라미터를 추가해주시면, 원하시는만큼의 파라미터를 함수에 전달 가능합니다.

In [272]:
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [273]:
df['yyyy-mm-dd'].apply(lambda x: x[:][:4])

0    2000
1    2002
2    2005
Name: yyyy-mm-dd, dtype: object

In [278]:
df['introduce'] = df['age'].apply(get_introduce, prefix = 'I am ', suffix = ' years old.')

In [277]:
df

   yyyy-mm-dd  year  age            introduce
0  2000-06-27  2000   23   I am 23 years old.
1  2002-09-24  2002   21   I am 21 years old.
2  2005-12-20  2005   18   I am 18 years old.

In [280]:
df['age'].apply(lambda x: 'I am ' + str(x) + ' years old.')

0    I am 23 years old.
1    I am 21 years old.
2    I am 18 years old.
Name: age, dtype: object

### apply 함수에 여러개의 컬럼을 동시에 전달하기
axis=1이라는 키워드 파라미터를 apply 함수에 전달해주면, 모든 컬럼을 지정된 함수에서 사용 가능합니다.

In [284]:
def get_introduce2(i):
    return "I was born in " + str(i.year) + ", My age is " + str(i.age)

In [286]:
df['introduce'] = df.apply(get_introduce2, axis=1)
df

   yyyy-mm-dd  year  age                         introduce
0  2000-06-27  2000   23  I was born in 2000, My age is 23
1  2002-09-24  2002   21  I was born in 2002, My age is 21
2  2005-12-20  2005   18  I was born in 2005, My age is 18

In [288]:
df.apply(lambda x:"I was born in " + str(x.year) + ", My age is " + str(x.age), axis=1)

0    I was born in 2000, My age is 23
1    I was born in 2002, My age is 21
2    I was born in 2005, My age is 18
dtype: object

### Map 함수로 컬럼 추가 및 변경하기
파라미터로 함수를 전달하면 apply 함수와 동일하게 컬럼값을 추가 및 변경할 수 있습니다.

In [289]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [295]:
def extract_year(i):
    return int(i.split('-')[0])

파라미터로 딕셔너리를 전달하면 컬럼값을 쉽게 원하는 값으로 변경 가능합니다.  
기존의 컬럼값은 딕셔너리의 key로 사용되고, 해당되는 value의 값으로 컬럼값이 변경됩니다.

In [297]:
df['year'] = df['yyyy-mm-dd'].map(extract_year)

In [298]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [306]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [307]:
df.job = df.job.map({"student":1,"developer":2,"teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

### Applymap
데이터프레임 전체의 각각의 값을 한번에 변경시키실 때 사용하시면 좋습니다.

In [309]:
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       3 non-null      float64
 1   y       3 non-null      float64
dtypes: float64(2)
memory usage: 176.0 bytes

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [311]:
df = df.applymap(np.around)
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

# 데이터프레임에 로우 추가하기

In [315]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [316]:
df2 = pd.DataFrame([['Ben',50,50]], columns = ['name','midterm','final'])

In [317]:
df2

  name  midterm  final
0  Ben       50     50

# Group by
데이터에서 정보를 취하기 위해서 그룹별로 묶는 방법에 대해 알아보겠습니다.

In [8]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [10]:
df.head()

      name             major     sex
0     John  Computer Science    male
1     Nate  Computer Science    male
2  Abraham           Physics    male
3    Brian        Psychology    male
4    Janny         Economics  female

In [17]:
groupby_major = df.groupby('major')
groupby_major.count()

                  name  sex
major
Computer Science     4    4
Economics            3    3
Physics              1    1
Psychology           3    3

In [12]:
groupby_major.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [13]:
df.major.value_counts()

major
Computer Science    4
Psychology          3
Economics           3
Physics             1
Name: count, dtype: int64

### here we can see, computer science has mostly man, while economic has mostly woman students

In [330]:
for name, group in groupby_major:
    print(name + ':' + str(len(group)))
    print(group)
    print()

Computer Science:4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics:3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics:1
      name    major   sex
2  Abraham  Physics  male

Psychology:3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

그룹 객체를 다시 데이터프레임으로 생성하는 예제입니다.

In [336]:
df_major_cnt = pd.DataFrame({'count': groupby_major.size()}).reset_index()

In [338]:
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [339]:
df_major_cnt.set_index('major')

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

아래의 출력을 통해, 이 학교의 남녀 성비가 균등하다는 정보를 알 수 있습니다.

In [346]:
groupby_sex = df.groupby('sex')

In [347]:
for name, group in groupby_sex:
    print(name + ':' + str(len(group)))
    print(group)
    print()

female:6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male:5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [351]:
df.sex.value_counts()

sex
female    6
male      5
Name: count, dtype: int64

# 중복 데이터 드롭하기
중복된 데이터 드롭하는 방법에 대해 알아보겠습니다.

In [353]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

## 중복된 데이터 확인 하기

In [355]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [356]:
df = df.drop_duplicates()

In [357]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

#### drop_duplicates 함수로 중복 데이터를 삭제하는 예제입니다.

In [359]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

name 컬럼이 똑같을 경우, 중복된 데이터라고 표시하라는 예제입니다.

In [362]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

keep 값을 first 또는 last라고 값을 줘서 중복된 값 중, 어느값을 살릴 지 결정하실 수 있습니다.  
기본적으로 first로 설정되어 있습니다.

In [365]:
df.drop_duplicates(['name'], keep = 'last')

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

# None 처리 하기

In [394]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

## Null 또는 NaN 확인하기

In [370]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [371]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

## Null 또는 NaN 값 변경하기

아래는 Null을 0으로 설정하는 예제입니다.

In [373]:
tmp = df
tmp['age'] = tmp['age'].fillna(0)
tmp

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [376]:
tmp.describe(include='object') # 디폴트가 include='number'
tmp.describe()

            age
count   8.00000
mean   18.12500
std    16.60841
min     0.00000
25%     7.50000
50%    11.50000
75%    35.50000
max    40.00000

0으로 설정하기 보다는 선생님의 중간 나이, 학생의 중간 나이로, 각각의 직업군에 맞게 Null값을 변경해줍니다.

In [395]:
# fill missing age with median age for each group (teacher, student)
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace = True)

In [396]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

# Unique
컬럼에 여러 값이 있을 때, 중복 없이 어떤 값들이 있는 지 확인하는 방법입니다.

In [18]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

컬럼(시리즈)의 unique() 함수를 사용하여, 중복 없이, 컬럼에 있는 모든 값들을 출력할 수 있습니다.

In [23]:
print(df.job.unique())
df.job.unique().size

['teacher' 'student' 'developer' 'dentist' 'lawyer' 'banker'
 'basketball player']

7

각 유니크한 값별로 몇개의 데이터가 속하는 지 value_counts() 함수로 확인할 수 있습니다.

In [24]:
df.job.value_counts()

job
teacher              8
student              5
lawyer               2
banker               2
developer            1
dentist              1
basketball player    1
Name: count, dtype: int64

# 두개의 데이터프레임 합치기

In [27]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])
print(df1,'\n')
print(df2)

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

## pd.concat
두번째 데이터프레임을 첫번째 데이터프레임의 새로운 로우(행)로 합칩니다.

In [32]:
frames = [df1,df2]
type(frames)
result = pd.concat(frames, ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

## df.append
두번째 데이터프레임을 첫번째 데이터프레임의 새로운 로우(행)로 합칩니다.

In [35]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])
result = pd.concat([df1,df2], ignore_index=True)

## pd.concat
두번째 데이터프레임을 첫번째 데이터프레임의 새로운 컬럼(열)으로 합칩니다.

In [42]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['age', 'country'])
df3 = pd.concat([df1,df2], ignore_index=True, axis=1)
result = pd.DataFrame(df3, columns = ['name','job','age','country'])
result

   name  job  age  country
0   NaN  NaN  NaN      NaN
1   NaN  NaN  NaN      NaN
2   NaN  NaN  NaN      NaN

# 두개의 리스트를 묶어서 데이터프레임으로 생성하기

In [445]:
label = [1,2,3,4,5]
prediction = [1,2,2,5,5]

comparison = pd.DataFrame(
    {'label': label,
     'prediction': prediction
    })

comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           5
4      5           5